1. Create 3 list viz. productId, Product Name, Product Price     with 5 elements each. Add this element to create a DataFrame
2. Extract one by one column and display separately from above dataframe.
3. Display separately each and every row from an above dataframe. (use loc or iloc function)
4. Display data name from 3 row using loc function.
5. Display price located in 2 row using iloc function.
6. Display 2nd to 4th row data excluding price.
7. Display 1 to 3rd row price data only.
8. Change marks in Maths column to 41 for students who have scored less than 40.
9. Add 2 marks to all the subjects marks. If any of the marks exceeds 100 change it to 100.
10. Display students who have scored more than 50 marks in Maths and more than 60 marks in Science.
11. Display students records whose name starts with letter S.
12. Display students records whose name ends with letter a.
13. Calculate total and percentage for all the students.
14. Calculate Status (PASS / FAIL) for the Students.
15. Calculate percentage based grade value (per>=90 then A-grade, per>=80 then B-grade, per>=70 then C-grade, per>=60 then D-grade, per>=50 then E-grade, per<50 then F.grade)
16. Also calculate overall columns total, maximum, minimum and standard deviation for each numeric columns Convert the above dataframe to excel, json and html.
17. Display meta-data for each column for the above dataframe.
18.Convert the above DataFrame to list within a dictionary.
19. Convert this dictionary again to a separate dataframe by adding 500 to each element in product price column.

In [1]:
import pandas as pd
import numpy as np

In [2]:
product_id=[101,102,103,104,105]
product_name=["Pen","Marker","Notebook","Pencil","Scissor"]
product_price=[20,30,70,10,78]

In [3]:
data={'Product ID':product_id,'Product Name':product_name,'Product Price':product_price}

In [4]:
data

{'Product ID': [101, 102, 103, 104, 105],
 'Product Name': ['Pen', 'Marker', 'Notebook', 'Pencil', 'Scissor'],
 'Product Price': [20, 30, 70, 10, 78]}

In [5]:
df

NameError: name 'df' is not defined

In [5]:
df=pd.DataFrame(data)

In [6]:
df.shape

(5, 3)

In [138]:
df.set_index("Product Name",inplace=True)
df.set_index?

In [142]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, Pen to Scissor
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Product ID     5 non-null      int64
 1   Product Price  5 non-null      int64
dtypes: int64(2)
memory usage: 120.0+ bytes

In [47]:
df.keys()

Index(['Product ID', 'Product Name', 'Product Price'], dtype='object')

In [48]:
df["Product Name"]

0         Pen
1      Marker
2    Notebook
3      Pencil
4     Scissor
Name: Product Name, dtype: object

In [19]:
df["Product Price"]

0    20
1    30
2    70
3    10
4    78
Name: Product Price, dtype: int64

In [50]:
df["Product ID"]

0    101
1    102
2    103
3    104
4    105
Name: Product ID, dtype: int64

In [29]:
for col in df.items():
    print(col)

('Product ID', 0    101
1    102
2    103
3    104
4    105
Name: Product ID, dtype: int64)
('Product Name', 0         Pen
1      Marker
2    Notebook
3      Pencil
4     Scissor
Name: Product Name, dtype: object)
('Product Price', 0    20
1    30
2    70
3    10
4    78
Name: Product Price, dtype: int64)

In [30]:
for row in df.iterrows():
    print(row)

(0, Product ID       101
Product Name     Pen
Product Price     20
Name: 0, dtype: object)
(1, Product ID          102
Product Name     Marker
Product Price        30
Name: 1, dtype: object)
(2, Product ID            103
Product Name     Notebook
Product Price          70
Name: 2, dtype: object)
(3, Product ID          104
Product Name     Pencil
Product Price        10
Name: 3, dtype: object)
(4, Product ID           105
Product Name     Scissor
Product Price         78
Name: 4, dtype: object)

In [152]:
df.loc['Marker':'Pencil',['Product Price']]

              Product Price
Product Name
Marker                   30
Notebook                 70
Pencil                   10

In [34]:
df.loc[2:]

2    70
3    10
4    78
Name: Product Price, dtype: int64

In [38]:
df.loc[1:4,df.columns!='Product Price']

   Product ID Product Name
1         102       Marker
2         103     Notebook
3         104       Pencil
4         105      Scissor

In [158]:
df.iloc[1:3]['Product Price']

Product Name
Marker      30
Notebook    70
Name: Product Price, dtype: int64

In [88]:
df.loc[101:103,["Product Price"]]

            Product Price
Product ID
101                    20
102                    30
103                    70

In [101]:
df.iloc[2:,0:2]

           Product Name  Product Price
Product ID
103            Notebook             70
104              Pencil             10
105             Scissor             78

In [102]:
df.iloc[1,1]

30

In [103]:
df

           Product Name  Product Price
Product ID
101                 Pen             20
102              Marker             30
103            Notebook             70
104              Pencil             10
105             Scissor             78

In [26]:
df= pd.DataFrame(np.random.randint(1,100
,(4,3)),index=['Riya','Siya','kiya','jiya'], 
columns=['python','Data Science','DBMS'])

In [27]:
df.dtypes

python          int32
Data Science    int32
DBMS            int32
dtype: object

In [41]:
df['python']<40

Riya    False
Siya     True
kiya    False
jiya     True
Name: python, dtype: bool

In [42]:
df[df['python']<40]

      python  Data Science  DBMS
Siya      19            71    21
jiya      38            89    86

In [45]:
df.loc[df['python']<40,'python']=41

df

      python  Data Science  DBMS
Riya      68             2    49
Siya      41            71    21
kiya      54            59    29
jiya      41            89    86

In [20]:
df.loc[df['python']<90,'python']=41

In [21]:
df

      python  Data Science  DBMS
Riya      41            87    26
Siya      41            94    23
kiya      41            28    85
jiya      41            83    87

In [26]:
df.python.unique()

array([41])

In [8]:
df['python'>60,'Data Science'>50]

TypeError: '>' not supported between instances of 'str' and 'int'

In [44]:
df2=df.python.drop_duplicates()

In [45]:
df2

Riya    50
Siya    41
jiya    84
Name: python, dtype: int32

In [6]:
df.dropna?

In [8]:
df.python*2

Riya    112
Siya     44
kiya    146
jiya     76
Name: python, dtype: int32

In [10]:
df.python=df.python*2

In [28]:
df.describe()

         python  Data Science       DBMS
count   4.00000      4.000000   4.000000
mean   30.25000     32.500000  26.750000
std    29.65777     14.059398  17.651723
min     3.00000     12.000000   6.000000
25%    12.00000     29.250000  19.500000
50%    23.50000     37.500000  26.000000
75%    41.75000     40.750000  33.250000
max    71.00000     43.000000  49.000000

In [29]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, Riya to jiya
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   python        4 non-null      int32
 1   Data Science  4 non-null      int32
 2   DBMS          4 non-null      int32
dtypes: int32(3)
memory usage: 80.0+ bytes

In [53]:
df.to_json('df.json')

In [54]:
df.to_excel('df1.xlsx')

In [56]:
df.dtypes

python          int32
Data Science    int32
DBMS            int32
dtype: object

In [34]:
d=df.to_dict(orient='list')

In [39]:
d['DBMS']

[6, 24, 28, 49]

In [ ]:
df

In [14]:
df.columns=['python1', 'Data Science1', 'DBMS1']

In [15]:
df

      python1  Data Science1  DBMS1
Riya      112             51     13
Siya       44             37     25
kiya      146             45     88
jiya       76             81     58

In [19]:
df.loc['Siya':'kiya']['Data Science1']

Siya    37
kiya    45
Name: Data Science1, dtype: int32

In [21]:
df.iloc[1:3]['DBMS1']

Siya    25
kiya    88
Name: DBMS1, dtype: int32

In [46]:
df

      python  Data Science  DBMS
Riya      68             2    49
Siya      41            71    21
kiya      54            59    29
jiya      41            89    86

In [48]:
df1=df+30

In [52]:
df1[df1>100]=100
df1

      python  Data Science  DBMS
Riya      98            32    79
Siya      71           100    51
kiya      84            89    59
jiya      71           100   100

In [88]:
df[df.index.str.startswith('S')]

      python  Data Science  DBMS
Siya      58            42    48

In [61]:
df1[df1>100]=100

In [62]:
df1[python]

      python  Data Science  DBMS
Riya      60            70    49
Siya      87            71    77
kiya      46           100   100
jiya     100           100   100

In [ ]:
&   |

In [141]:
df[(df['python']>50)  & (df['Data Science']>60)]

      python  Data Science  DBMS
Siya      92            63    83

In [145]:
df[df.index.str.startswith('S')]

      python  Data Science  DBMS
Siya      92            63    83

In [5]:
df["total"]=df['python']+df['Data Science']+df['DBMS']

In [7]:
df

      python  Data Science  DBMS  total
Riya      28            44    35    107
Siya      93            11    67    171
kiya      66            21    68    155
jiya      59            83     4    146

In [6]:
df['per']=df['total']/3

In [9]:
df

      python  Data Science  DBMS  total        per
Riya      28            44    35    107  35.666667
Siya      93            11    67    171  57.000000
kiya      66            21    68    155  51.666667
jiya      59            83     4    146  48.666667

In [121]:
df1["Result"]=df1['per']>40

In [122]:
df1

      python  Data Science  DBMS  total        per  Result
Riya      52            62    41     92  30.666667   False
Siya      79            63    69    148  49.333333    True
kiya      38           103   100    178  59.333333    True
jiya     103            97   108    245  81.666667    True

In [134]:
df1.loc[df1['per']<34,'Result']="Fail"

In [135]:
df1

      python  Data Science  DBMS  total        per Result
Riya      52            62    41     92  30.666667   Fail
Siya      79            63    69    148  49.333333   Pass
kiya      38           103   100    178  59.333333   Pass
jiya     103            97   108    245  81.666667   Pass

In [12]:
df['Grade']=np.where(df['per']>35,"E",np.where(df['per']>45,'D',np.where(df['per']>55,'A','F')))

In [22]:
df['Result']=np.where(df['per']<45,"Fail","pass")

In [13]:
df

      python  Data Science  DBMS  total        per Result Grade
Riya      15            29    41     85  28.333333   Fail     F
Siya      51            41    70    162  54.000000   Pass     E
kiya      35            68     8    111  37.000000   Fail     E
jiya      45            21     1     67  22.333333   Fail     F

In [7]:
df

      python  Data Science  DBMS  total        per
Riya      15            29    41     85  28.333333
Siya      51            41    70    162  54.000000
kiya      35            68     8    111  37.000000
jiya      45            21     1     67  22.333333

In [8]:
df['Result']=np.where(df['per']<40,"Fail","Pass")

In [14]:
df

      python  Data Science  DBMS  total        per Result Grade
Riya      15            29    41     85  28.333333   Fail     F
Siya      51            41    70    162  54.000000   Pass     E
kiya      35            68     8    111  37.000000   Fail     E
jiya      45            21     1     67  22.333333   Fail     F

In [15]:
df['Grade']=np.where(df['per']>35,"E",np.where(df['per']>45,'D',np.where(df['per']>55,'A','F')))

In [1]:
df.loc[df['per']>40,'Grade']='B'
df.loc[df['per']>50,'Grade']='A'

NameError: name 'df' is not defined

In [6]:
import pandas as pd

In [7]:
import numpy as np

In [8]:
df=pd.read_csv("C:/Users/Tamanna.Soni/Downloads/datasets DS/Salaries.csv")

C:\Users\Tamanna.Soni\AppData\Local\Temp\ipykernel_9476\1929819750.py:1: DtypeWarning: Columns (3,4,5,6,12) have mixed types. Specify dtype option on import or set low_memory=False.
  df=pd.read_csv("C:/Users/Tamanna.Soni/Downloads/datasets DS/Salaries.csv")

In [73]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148049 non-null  object
 4   OvertimePay       148654 non-null  object
 5   OtherPay          148654 non-null  object
 6   Benefits          112495 non-null  object
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            38119 non-null   object
dtypes: float64(3), int64(2), object(8)
memory usage: 14.7+ MB

In [80]:
df=df.replace('Not Provided',np.nan)

In [81]:
df=df.replace('Not provided',np.nan)

In [82]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148648 non-null  object
 2   JobTitle          148650 non-null  object
 3   BasePay           148045 non-null  object
 4   OvertimePay       148650 non-null  object
 5   OtherPay          148650 non-null  object
 6   Benefits          112491 non-null  object
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            38119 non-null   object
dtypes: float64(3), int64(2), object(8)
memory usage: 14.7+ MB

In [66]:
df['BasePay']=df['BasePay'].astype('float')

In [67]:
df['BasePay'].dtype

dtype('float64')

In [68]:
df['BasePay'].mean()

66325.4488404877

In [76]:
df_year=df.groupby('Year')

In [85]:
df_year.describe().transpose()

Year                             2011           2012           2013  \
Id               count   36159.000000   36766.000000   37606.000000
                 mean    18080.000000   54542.500000   91728.500000
                 std     10438.348528   10613.574335   10856.061448
                 min         1.000000   36160.000000   72926.000000
                 25%      9040.500000   45351.250000   82327.250000
                 50%     18080.000000   54542.500000   91728.500000
                 75%     27119.500000   63733.750000  101129.750000
                 max     36159.000000   72925.000000  110531.000000
TotalPay         count   36159.000000   36766.000000   37606.000000
                 mean    71744.103871   74113.262265   77611.443142
                 std     47498.706594   49523.904319   52854.774783
                 min         0.000000       0.000000       0.000000
                 25%     36810.760000   37560.607500   36754.995000
                 50%     68213.240000   70714.680000   74500.015000
                 75%    102512.680000  104099.170000  109637.670000
                 max    567595.430000  362844.660000  347102.320000
TotalPayBenefits count   36159.000000   36766.000000   37606.000000
                 mean    71744.103871  100553.229232  101440.519714
                 std     47498.706594   63555.796681   66390.034642
                 min         0.000000       1.910000     -33.890000
                 25%     36810.760000   51743.092500   48259.600000
                 50%     68213.240000  101751.290000  101969.445000
                 75%    102512.680000  142396.332500  142793.687500
                 max    567595.430000  407274.780000  425815.280000
Notes            count       0.000000       0.000000       0.000000
                 mean             NaN            NaN            NaN
                 std              NaN            NaN            NaN
                 min              NaN            NaN            NaN
                 25%              NaN            NaN            NaN
                 50%              NaN            NaN            NaN
                 75%              NaN            NaN            NaN
                 max              NaN            NaN            NaN

Year                             2014
Id               count   38123.000000
                 mean   129593.000000
                 std     11005.306493
                 min    110532.000000
                 25%    120062.500000
                 50%    129593.000000
                 75%    139123.500000
                 max    148654.000000
TotalPay         count   38123.000000
                 mean    75463.918140
                 std     51697.713029
                 min      -618.130000
                 25%     33436.210000
                 50%     72359.980000
                 75%    107974.445000
                 max    471952.640000
TotalPayBenefits count   38123.000000
                 mean   100250.918884
                 std     66238.852887
                 min      -618.130000
                 25%     44199.990000
                 50%    101105.370000
                 75%    142746.950000
                 max    510732.680000
Notes            count       0.000000
                 mean             NaN
                 std              NaN
                 min              NaN
                 25%              NaN
                 50%              NaN
                 75%              NaN
                 max              NaN

In [10]:
df.dropna(1)

TypeError: DataFrame.dropna() takes 1 positional argument but 2 were given

In [17]:
data1= {'sid': [123,456,789],
       'sname':['Gajodhar','Bheem','Ghatotkach']}
data2= {'sid': [123,456,789],
       'smarks':[88,55,99]}
df=pd.DataFrame(data1)
df2=pd.DataFrame(data2)
df
display(df,df2)

   sid       sname
0  123    Gajodhar
1  456       Bheem
2  789  Ghatotkach

   sid  smarks
0  123      88
1  456      55
2  789      99

In [21]:
pd.merge(data1,data2)

TypeError: Can only merge Series or DataFrame objects, a <class 'dict'> was passed

In [1]:
Pandas was developed in the context of financial modeling, so as you might expect, it
contains a fairly extensive set of tools for working with dates, times, and time- indexed data

SyntaxError: invalid syntax (3953078525.py, line 1)

In [2]:
import seaborn as sns

In [3]:
sns.get_data_home()

'C:\\Users\\Tamanna.Soni\\AppData\\Local\\seaborn\\seaborn\\Cache'

In [4]:
sns.get_dataset_names()

['anagrams',
 'anscombe',
 'attention',
 'brain_networks',
 'car_crashes',
 'diamonds',
 'dots',
 'dowjones',
 'exercise',
 'flights',
 'fmri',
 'geyser',
 'glue',
 'healthexp',
 'iris',
 'mpg',
 'penguins',
 'planets',
 'seaice',
 'taxis',
 'tips',
 'titanic',
 'anagrams',
 'anagrams',
 'anscombe',
 'anscombe',
 'attention',
 'attention',
 'brain_networks',
 'brain_networks',
 'car_crashes',
 'car_crashes',
 'diamonds',
 'diamonds',
 'dots',
 'dots',
 'dowjones',
 'dowjones',
 'exercise',
 'exercise',
 'flights',
 'flights',
 'fmri',
 'fmri',
 'geyser',
 'geyser',
 'glue',
 'glue',
 'healthexp',
 'healthexp',
 'iris',
 'iris',
 'mpg',
 'mpg',
 'penguins',
 'penguins',
 'planets',
 'planets',
 'seaice',
 'seaice',
 'taxis',
 'taxis',
 'tips',
 'tips',
 'titanic',
 'titanic',
 'anagrams',
 'anscombe',
 'attention',
 'brain_networks',
 'car_crashes',
 'diamonds',
 'dots',
 'dowjones',
 'exercise',
 'flights',
 'fmri',
 'geyser',
 'glue',
 'healthexp',
 'iris',
 'mpg',
 'penguins',
 'planets',
 'seaice',
 'taxis',
 'tips',
 'titanic']